Documents/ESB/ESB_Consumer_0605/003TestSample/SAMPLE_XML_MUST/DebitCard/DC04_DbCardLmtInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://https://www.nextbank.com.tw//xsd/TW/DebitCard/DbCardLmtInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardLmtInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardLmtInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC04</v11:TxnId>  
        <v11:TxnNo>DC0400001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:PageNo>1</v11:PageNo>  
        <v11:NoOfPage>200</v11:NoOfPage>  
        <v11:InqType>2</v11:InqType>  
        <v11:InqKeyId>5211958800000591</v11:InqKeyId> 
      </v11:ServiceBody> 
    </v11:DbCardLmtInqRq> 
  </soap:Body> 
</soap:Envelope>
